dkwill/nRF52_MD612_Quats_Accel_wBLE/ble_peripheral/ble_app_md612/main.c
#define SCHED_MAX_EVENT_DATA_SIZE       MAX(APP_TIMER_SCHED_EVT_SIZE, \
                                            BLE_STACK_HANDLER_SCHED_EVT_SIZE)         /**< Maximum size of scheduler events. */
#define SCHED_QUEUE_SIZE                10                                            /**< Maximum number of events in the scheduler queue. */


#define DEAD_BEEF                       0xDEADBEEF                                    /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define BLE_UUID_BASE_UUID              {{0x23, 0xD1, 0x13, 0xEF, 0x5F, 0x78,  0x23, 0x15,0xDE, 0xEF,0x12, 0x12, 0x00, 0x00, 0x00, 0x00}} 			// 128-bit base UUID

#define BLE_UUID_MDE_SERVICE_UUID			0xF00D // Just a random, but recognizable value
#define BLE_UUID_X_CHARACTERISTC_UUID    	0xACCE
#define BLE_UUID_Y_CHARACTERISTC_UUID    	0xBEEF
#define BLE_UUID_Z_CHARACTERISTC_UUID 		0xCEEF
#define BLE_UUID_YAWR_CHARACTERISTC_UUID 	0xDEEF  // reset Yaw Reset

#define APP_FEATURE_NOT_SUPPORTED       	BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2                      /**< Reply when unsupported features are requested. */

/*
 * Battery BLE definitions
 */
#define BATTERY_LEVEL_MEAS_INTERVAL     APP_TIMER_TICKS(2000, APP_TIMER_PRESCALER) /**< Battery level measurement interval (ticks). */
#define MIN_BATTERY_LEVEL               81                                         /**< Minimum simulated battery level. */
#define MAX_BATTERY_LEVEL               100                                        /**< Maximum simulated battery level. */
#define BATTERY_LEVEL_INCREMENT         1                                          /**< Increment between each simulated battery level measurement. */

/*
 * Defines for the MPU Board and NRF52
 */

#ifdef BOARD_PCA10040
#undef ARDUINO_SCL_PIN
#undef ARDUINO_SDA_PIN
#define ARDUINO_SCL_PIN             	3    // SCL signal pin
#define ARDUINO_SDA_PIN            	 	4    // SDA signal pin
#define MPU_INT_PIN                     11

//#define ARDUINO_SCL_PIN             	26    // SCL signal pin
//#define ARDUINO_SDA_PIN             	27    // SDA signal pin
//#define MPU_INT_PIN                   11

#else
#define MPU_INT_PIN                     10
#endif

#ifdef NRF_LOG_BACKEND_SERIAL_USES_UART
#define UART_TX_BUF_SIZE                256                                        /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                1                                          /**< UART RX buffer size. */

#endif

#define TWI_MAX_PENDING_TRANSACTIONS    5

//  our BLE service variable and other BLE variables
typedef struct {
	uint16_t conn_handle; 						/**< Handle of the current connection (as provided by the BLE stack, is BLE_CONN_HANDLE_INVALID if not in a connection).*/
	uint16_t service_handle; 					/**< Handle of ble Service (as provided by the BLE stack). */
	ble_gatts_char_handles_t x_char_handles; 	/**< Handles related to the our new characteristic. */
	ble_gatts_char_handles_t y_char_handles; 	/**< Handles related to the our new characteristic. */
	ble_gatts_char_handles_t z_char_handles; 	/**< Handles related to the our new characteristic. */
} ble_mde_t;

static ble_mde_t m_mde; 						/**< MDE BLE Information. */

static pm_peer_id_t m_peer_id; 												/**< Device reference handle to the current bonded central. */

static pm_peer_id_t m_whitelist_peers[BLE_GAP_WHITELIST_ADDR_MAX_COUNT]; 	/**< List of peers currently in the whitelist. */
static uint32_t m_whitelist_peer_cnt; 										/**< Number of peers currently in the whitelist. */
static bool m_is_wl_changed; 												/**< Indicates if the whitelist has been changed since last time it has been updated in the Peer Manager. */

/*
 * Battery variables
 */
static ble_bas_t m_bas; 													/**< Structure used to identify the battery service. */
static sensorsim_cfg_t m_battery_sim_cfg; 									/**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state; 								/**< Battery Level sensor simulator state. */

APP_TIMER_DEF(m_battery_timer_id); 											/**< Battery timer. */

/*
 * twi interface variables
 */
app_twi_t m_app_twi = APP_TWI_INSTANCE(0);

// call back function used by the MD612 to notify of changes.
static void motiondriver_callback(unsigned char type, long *data,
		int8_t accuracy, unsigned long timestamp);

// Pulled out of function has to exist even after fucntion exits.
static platform_data_t const platform_data = {
		.pin = MPU_INT_PIN,
		.cb = motiondriver_callback,

/* The sensors can be mounted onto the board in any orientation. The mounting
 * matrix seen below tells the MPL how to rotate the raw data from the
 * driver(s).
 */
.gyro_orientation = { 1, 0, 0, 0, 1, 0, 0, 0, 1 },

#if defined MPU9150 || defined MPU9250
		.compass_orientation = {0, 1, 0,
			1, 0, 0,
			0, 0,-1}

#elif defined AK8975_SECONDARY
		.compass_orientation = {-1, 0, 0,
			0, 1, 0,
			0, 0,-1}

#elif defined AK8963_SECONDARY
		.compass_orientation = {-1, 0, 0,
			0,-1, 0,
			0, 0, 1}
#endif
	};

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name) {
	app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Fetch the list of peer manager peer IDs.
 *
 * @param[inout] p_peers   The buffer where to store the list of peer IDs.
 * @param[inout] p_size    In: The size of the @p p_peers buffer.
 *                         Out: The number of peers copied in the buffer.
 */
static void peer_list_get(pm_peer_id_t * p_peers, uint32_t * p_size) {
	pm_peer_id_t peer_id;
	uint32_t peers_to_copy;

