dkwill/nRF52_MD612_Quats_Accel_wBLE/ble_peripheral/ble_app_md612/main.c
	peers_to_copy =	(*p_size < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) ? 	*p_size : BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

	peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);
	*p_size = 0;

	while ((peer_id != PM_PEER_ID_INVALID) && (peers_to_copy--)) {
		p_peers[(*p_size)++] = peer_id;
		peer_id = pm_next_peer_id_get(peer_id);
	}
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void) {
	ret_code_t ret;

	memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
	m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));

	peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);

	ret = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
	APP_ERROR_CHECK(ret);

	// Setup the device identies list.
	// Some SoftDevices do not support this feature.
	ret = pm_device_identities_list_set(m_whitelist_peers,
			m_whitelist_peer_cnt);
	if (ret != NRF_ERROR_NOT_SUPPORTED) {
		APP_ERROR_CHECK(ret);
	}

	m_is_wl_changed = false;

	ret = ble_advertising_start(BLE_ADV_MODE_FAST);
	APP_ERROR_CHECK(ret);
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt) {
	ret_code_t err_code;

	NRF_LOG_INFO("pm_evt_Handler %d\r\n", p_evt->evt_id);

	switch (p_evt->evt_id) {
	case PM_EVT_BONDED_PEER_CONNECTED: {
		NRF_LOG_DEBUG("Connected to previously bonded device\r\n");
		err_code = pm_peer_rank_highest(p_evt->peer_id);
		if (err_code != NRF_ERROR_BUSY) {
			APP_ERROR_CHECK(err_code);
		}
	}
		break; // PM_EVT_BONDED_PEER_CONNECTED

	case PM_EVT_CONN_SEC_START:
		NRF_LOG_INFO("PM_EVT_CONN_SEC_START %d\r\n", p_evt->evt_id)
		;
		break; // PM_EVT_CONN_SEC_START

	case PM_EVT_CONN_SEC_SUCCEEDED: {
		NRF_LOG_DEBUG(
				"Link secured. Role: %d. conn_handle: %d, Procedure: %d\r\n",
				ble_conn_state_role(p_evt->conn_handle), p_evt->conn_handle,
				p_evt->params.conn_sec_succeeded.procedure);
		err_code = pm_peer_rank_highest(p_evt->peer_id);
		if (err_code != NRF_ERROR_BUSY) {
			APP_ERROR_CHECK(err_code);
		}
		if (p_evt->params.conn_sec_succeeded.procedure
				== PM_LINK_SECURED_PROCEDURE_BONDING) {
			NRF_LOG_DEBUG(
					"New Bond, add the peer to the whitelist if possible\r\n");
			NRF_LOG_DEBUG("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d\r\n",
					m_whitelist_peer_cnt + 1, BLE_GAP_WHITELIST_ADDR_MAX_COUNT);
			if (m_whitelist_peer_cnt < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) {
				//bonded to a new peer, add it to the whitelist.
				m_whitelist_peers[m_whitelist_peer_cnt++] = m_peer_id;
				m_is_wl_changed = true;
			}
			//Note: This code will use the older bonded device in the white list and not add any newer bonded to it
			//      You should check on what kind of white list policy your application should use.
		}
	}
		break; // PM_EVT_CONN_SEC_SUCCEEDED

	case PM_EVT_CONN_SEC_FAILED: {
		/** In some cases, when securing fails, it can be restarted directly. Sometimes it can
		 *  be restarted, but only after changing some Security Parameters. Sometimes, it cannot
		 *  be restarted until the link is disconnected and reconnected. Sometimes it is
		 *  impossible, to secure the link, or the peer device does not support it. How to
		 *  handle this error is highly application dependent. */
		switch (p_evt->params.conn_sec_failed.error) {
		case PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING:
			// Rebond if one party has lost its keys.
			err_code = pm_conn_secure(p_evt->conn_handle, true);
			if (err_code != NRF_ERROR_INVALID_STATE) {
				APP_ERROR_CHECK(err_code);
			}
			break; // PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING

		default:
			break;
		}
	}
		break; // PM_EVT_CONN_SEC_FAILED

	case PM_EVT_CONN_SEC_CONFIG_REQ: {
		// Reject pairing request from an already bonded peer.
		pm_conn_sec_config_t conn_sec_config = { .allow_repairing = false };
		pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
	}
		break; // PM_EVT_CONN_SEC_CONFIG_REQ

	case PM_EVT_STORAGE_FULL: {
		// Run garbage collection on the flash.
		err_code = fds_gc();
		if (err_code == FDS_ERR_BUSY
				|| err_code == FDS_ERR_NO_SPACE_IN_QUEUES) {
			// Retry.
		} else {
			APP_ERROR_CHECK(err_code);
		}
	}
		break; // PM_EVT_STORAGE_FULL

	case PM_EVT_ERROR_UNEXPECTED:
		// Assert.
		APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
		break; // PM_EVT_ERROR_UNEXPECTED

	case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
		NRF_LOG_INFO("PM_EVT_PEER_DATA_UPDATE_SUCCEEDED %d\r\n", p_evt->evt_id)
		;
		break; // PM_EVT_PEER_DATA_UPDATE_SUCCEEDED

	case PM_EVT_PEER_DATA_UPDATE_FAILED:
		// Assert.
		APP_ERROR_CHECK_BOOL(false);
		break; // PM_EVT_PEER_DATA_UPDATE_FAILED

	case PM_EVT_PEER_DELETE_SUCCEEDED:
		break; // PM_EVT_PEER_DELETE_SUCCEEDED

	case PM_EVT_PEER_DELETE_FAILED:
		// Assert.
		APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
		break; // PM_EVT_PEER_DELETE_FAILED

	case PM_EVT_PEERS_DELETE_SUCCEEDED:
		advertising_start();
		break; // PM_EVT_PEERS_DELETE_SUCCEEDED

	case PM_EVT_PEERS_DELETE_FAILED:
		// Assert.
		APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
		break; // PM_EVT_PEERS_DELETE_FAILED

	case PM_EVT_LOCAL_DB_CACHE_APPLIED:
		break; // PM_EVT_LOCAL_DB_CACHE_APPLIED

	case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
		// The local database has likely changed, send service changed indications.
		pm_local_database_has_changed();
		break; // PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED

	case PM_EVT_SERVICE_CHANGED_IND_SENT:
		break; // PM_EVT_SERVICE_CHANGED_IND_SENT

	case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
		break; // PM_EVT_SERVICE_CHANGED_IND_SENT

	default:
		NRF_LOG_INFO("Default %d\r\n", p_evt->evt_id)
		;
		// No implementation needed.
		break;
	}
}

/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error) {
	APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void) {
	uint32_t err_code;
	uint8_t battery_level;

