dkwill/nRF52_MD612_Quats_Accel_wBLE/ble_peripheral/ble_app_md612/main.c
	battery_level = (uint8_t) sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

	err_code = ble_bas_battery_level_update(&m_bas, battery_level);
	if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_INVALID_STATE)
			&& (err_code != BLE_ERROR_NO_TX_PACKETS)
			&& (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)) {
		APP_ERROR_HANDLER(err_code);
	}
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context) {
	UNUSED_PARAMETER(p_context);
	battery_level_update();
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void) {
	uint32_t err_code;

	// Initialize timer module, making it use the scheduler.
	APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, true);

	// Create battery timer.
	err_code = app_timer_create(&m_battery_timer_id, APP_TIMER_MODE_REPEATED,
			battery_level_meas_timeout_handler);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void) {
	uint32_t err_code;
	ble_gap_conn_params_t gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	err_code = sd_ble_gap_device_name_set(&sec_mode,
			(const uint8_t *) DEVICE_NAME, strlen(DEVICE_NAME));
	APP_ERROR_CHECK(err_code);

	memset(&gap_conn_params, 0, sizeof(gap_conn_params));

	gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
	gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
	gap_conn_params.slave_latency = SLAVE_LATENCY;
	gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

	err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing Battery Service.
 */
static void bas_init(void) {
	uint32_t err_code;
	ble_bas_init_t bas_init_obj;

	memset(&bas_init_obj, 0, sizeof(bas_init_obj));

	bas_init_obj.evt_handler = NULL;
	bas_init_obj.support_notification = true;
	bas_init_obj.p_report_ref = NULL;
	bas_init_obj.initial_batt_level = 100;

	BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(
			&bas_init_obj.battery_level_char_attr_md.cccd_write_perm);
	BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(
			&bas_init_obj.battery_level_char_attr_md.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(
			&bas_init_obj.battery_level_char_attr_md.write_perm);

	BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(
			&bas_init_obj.battery_level_report_read_perm);

	err_code = ble_bas_init(&m_bas, &bas_init_obj);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for adding our new characteristic to "Our service"
 *
 * @param[in]   p_mde        mde structure.
 *
 */
static uint32_t ble_char_mde_add(ble_mde_t * p_mde) {

	uint32_t err_code = 0; 		// Variable to hold return codes from library and softdevice functions
	ble_uuid_t char_uuid;

	ble_uuid128_t base_uuid = BLE_UUID_BASE_UUID;

	// setup the 1st characteristic UUID.
	BLE_UUID_BLE_ASSIGN(char_uuid, BLE_UUID_X_CHARACTERISTC_UUID);
	sd_ble_uuid_vs_add(&base_uuid, &char_uuid.type);
	APP_ERROR_CHECK(err_code);

	// setup the attribute metadata - permissions, auth levels, variable length
	// or not and where in memory stored - storing information in stack
	ble_gatts_attr_md_t attr_md;
	memset(&attr_md, 0, sizeof(attr_md));
	attr_md.vloc = BLE_GATTS_VLOC_STACK;  // store information in stack other option (BLE_GATTS_VLOC_USER)

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

	// Configure the charateristic value attribute - contains the actual value..
	ble_gatts_attr_t attr_char_value;
	memset(&attr_char_value, 0, sizeof(attr_char_value));
	attr_char_value.p_uuid = &char_uuid;
	attr_char_value.p_attr_md = &attr_md;
	attr_char_value.max_len = sizeof (int16_t);
	attr_char_value.init_len = sizeof (int16_t);
	uint8_t value[2] = { 1 };                   // just for testing set to 1.
	attr_char_value.p_value = value;

	ble_gatts_char_md_t char_md;
	memset(&char_md, 0, sizeof(char_md));
	char_md.char_props.read = 1;
	char_md.char_props.write = 1;

	// setup the attribute metadata for charaterictic
	ble_gatts_attr_md_t cccd_md;
	memset(&cccd_md, 0, sizeof(cccd_md));
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
	cccd_md.vloc = BLE_GATTS_VLOC_STACK;
	char_md.p_cccd_md = &cccd_md;
	char_md.char_props.notify = 1;

	// Add up X characteristic
	err_code = sd_ble_gatts_characteristic_add(p_mde->service_handle, &char_md,
			&attr_char_value, &p_mde->x_char_handles);
	APP_ERROR_CHECK(err_code);

	// setup the Y characteristic UUID.
	BLE_UUID_BLE_ASSIGN(char_uuid, BLE_UUID_Y_CHARACTERISTC_UUID);
	sd_ble_uuid_vs_add(&base_uuid, &char_uuid.type);
	APP_ERROR_CHECK(err_code);
	// add up Y characteristic
	value[0] = 2;
	value[1] = 2;  // just for testing set to 2.
	err_code = sd_ble_gatts_characteristic_add(p_mde->service_handle, &char_md,
				&attr_char_value, &p_mde->y_char_handles);
	APP_ERROR_CHECK(err_code);

	// setup the Z characteristic UUID.
	BLE_UUID_BLE_ASSIGN(char_uuid, BLE_UUID_Z_CHARACTERISTC_UUID);
	sd_ble_uuid_vs_add(&base_uuid, &char_uuid.type);
	APP_ERROR_CHECK(err_code);
	value[0] = 3;                   // just for testing set to 3.
	value[1] = 3;
	// add up Y characteristic
	err_code = sd_ble_gatts_characteristic_add(p_mde->service_handle, &char_md,
				&attr_char_value, &p_mde->z_char_handles);
	APP_ERROR_CHECK(err_code);

	return NRF_SUCCESS;
}

/**@brief Function for initiating our new service.
 *
 * @param[in]   p_mde        Our Service structure.
 *
 */
void ble_mde_service_init(ble_mde_t * p_mde) {
	uint32_t err_code; // Variable to hold return codes from library and softdevice functions

	ble_uuid_t service_uuid;
	ble_uuid128_t base_uuid = BLE_UUID_BASE_UUID;
	service_uuid.uuid = BLE_UUID_MDE_SERVICE_UUID;

	err_code = sd_ble_uuid_vs_add(&base_uuid, &service_uuid.type);
	APP_ERROR_CHECK(err_code);

	// set to invalid handle 0xffff
	p_mde->conn_handle = BLE_CONN_HANDLE_INVALID;

	err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
			&service_uuid, &p_mde->service_handle);

	APP_ERROR_CHECK(err_code);

	NRF_LOG_INFO("Service UUID: 0x%#04x\n", service_uuid.uuid);
	NRF_LOG_INFO("Service UUID type: 0x%#02x\n", service_uuid.type);
	NRF_LOG_INFO("Service handle: 0x%#04x\n", p_mde->service_handle);


	ble_char_mde_add(p_mde);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void) {

	ble_mde_service_init(&m_mde);
	bas_init();

