dkwill/nRF52_MD612_Quats_Accel_wBLE/ble_peripheral/ble_app_md612/main.c
}

/**@brief Function for initializing the battery sensor simulator.
 */
static void sensor_simulator_init(void) {
	m_battery_sim_cfg.min = MIN_BATTERY_LEVEL;
	m_battery_sim_cfg.max = MAX_BATTERY_LEVEL;
	m_battery_sim_cfg.incr = BATTERY_LEVEL_INCREMENT;
	m_battery_sim_cfg.start_at_max = true;

	sensorsim_init(&m_battery_sim_state, &m_battery_sim_cfg);
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error) {
	APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void) {
	uint32_t err_code;
	ble_conn_params_init_t cp_init;

	memset(&cp_init, 0, sizeof(cp_init));

	cp_init.p_conn_params = NULL;
	cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
	cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
	cp_init.max_conn_params_update_count = MAX_CONN_PARAM_UPDATE_COUNT;
	cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
	cp_init.disconnect_on_fail = false;
	cp_init.evt_handler = NULL;
	cp_init.error_handler = conn_params_error_handler;

	err_code = ble_conn_params_init(&cp_init);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting timers.
 */
static void timers_start(void) {
	uint32_t err_code;

	err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL,
			NULL);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void) {
	uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);

	NRF_LOG_INFO ("sleep 1\r\n");
	APP_ERROR_CHECK(err_code);

	// Prepare wakeup buttons.
	err_code = bsp_btn_ble_sleep_mode_prepare();
	NRF_LOG_INFO ("sleep 2\r\n");
	APP_ERROR_CHECK(err_code);

	// Go to system-off mode (this function will not return; wakeup will cause a reset).
	err_code = sd_power_system_off();
	NRF_LOG_INFO ("sleep 3\r\n");
	APP_ERROR_CHECK(err_code);
	NRF_LOG_INFO ("sleep 4\r\n");
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt) {
	uint32_t err_code;

	switch (ble_adv_evt) {
	case BLE_ADV_EVT_DIRECTED:
		NRF_LOG_INFO("BLE_ADV_EVT_DIRECTED\r\n");
		err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_ADV_EVT_FAST:
		NRF_LOG_INFO("BLE_ADV_EVT_FAST\r\n")
		;
		err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_ADV_EVT_SLOW:
		NRF_LOG_INFO("BLE_ADV_EVT_SLOW\r\n");
		err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_SLOW);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_ADV_EVT_FAST_WHITELIST:
		NRF_LOG_INFO("BLE_ADV_EVT_FAST_WHITELIST\r\n");
		err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_ADV_EVT_SLOW_WHITELIST:
		NRF_LOG_INFO("BLE_ADV_EVT_SLOW_WHITELIST\r\n");
		err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
		APP_ERROR_CHECK(err_code);
		err_code = ble_advertising_restart_without_whitelist();
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_ADV_EVT_IDLE:
		err_code = bsp_indication_set(BSP_INDICATE_IDLE);
		APP_ERROR_CHECK(err_code);
		sleep_mode_enter();
		break;

	case BLE_ADV_EVT_WHITELIST_REQUEST: {
		ble_gap_addr_t whitelist_addrs[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
		ble_gap_irk_t whitelist_irks[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
		uint32_t addr_cnt = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
		uint32_t irk_cnt = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

		err_code = pm_whitelist_get(whitelist_addrs, &addr_cnt, whitelist_irks,
				&irk_cnt);
		APP_ERROR_CHECK(err_code);
		NRF_LOG_DEBUG("pm_whitelist_get returns %d addr in whitelist and %d irk whitelist\r\n",
				addr_cnt, irk_cnt);

		// Apply the whitelist.
		err_code = ble_advertising_whitelist_reply(whitelist_addrs, addr_cnt,
				whitelist_irks, irk_cnt);
		APP_ERROR_CHECK(err_code);
	}
		break;

	case BLE_ADV_EVT_PEER_ADDR_REQUEST: {
		pm_peer_data_bonding_t peer_bonding_data;

		// Only Give peer address if we have a handle to the bonded peer.
		if (m_peer_id != PM_PEER_ID_INVALID) {

			err_code = pm_peer_data_bonding_load(m_peer_id, &peer_bonding_data);
			if (err_code != NRF_ERROR_NOT_FOUND) {
				APP_ERROR_CHECK(err_code);

				ble_gap_addr_t * p_peer_addr =
						&(peer_bonding_data.peer_id.id_addr_info);
				err_code = ble_advertising_peer_addr_reply(p_peer_addr);
				APP_ERROR_CHECK(err_code);
			}

		}
		break;
	}

	default:
		break;
	}
}

/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt) {
	uint32_t err_code;

	switch (p_ble_evt->header.evt_id) {
	case BLE_GAP_EVT_CONNECTED:
		NRF_LOG_INFO("Connected\r\n");
		err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
		APP_ERROR_CHECK(err_code);

		m_mde.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
		break; // BLE_GAP_EVT_CONNECTED

	case BLE_GAP_EVT_DISCONNECTED:
		NRF_LOG_INFO("Disconnected\r\n");
		err_code = bsp_indication_set(BSP_INDICATE_IDLE);
		APP_ERROR_CHECK(err_code);

		m_mde.conn_handle = BLE_CONN_HANDLE_INVALID;

		if (m_is_wl_changed) {
			// The whitelist has been modified, update it in the Peer Manager.
			err_code = pm_whitelist_set(m_whitelist_peers,
					m_whitelist_peer_cnt);
			APP_ERROR_CHECK(err_code);

			err_code = pm_device_identities_list_set(m_whitelist_peers,
					m_whitelist_peer_cnt);
			if (err_code != NRF_ERROR_NOT_SUPPORTED) {
				APP_ERROR_CHECK(err_code);
			}

			m_is_wl_changed = false;
		}
		break; // BLE_GAP_EVT_DISCONNECTED

	case BLE_GATTC_EVT_TIMEOUT:
		// Disconnect on GATT Client timeout event.
		NRF_LOG_DEBUG("GATT Client Timeout.\r\n");
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
		BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break; // BLE_GATTC_EVT_TIMEOUT

	case BLE_GATTS_EVT_TIMEOUT:
		// Disconnect on GATT Server timeout event.
		NRF_LOG_DEBUG("GATT Server Timeout.\r\n");
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
		BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break; // BLE_GATTS_EVT_TIMEOUT

	case BLE_EVT_USER_MEM_REQUEST:
		err_code = sd_ble_user_mem_reply(m_mde.conn_handle, NULL);
		APP_ERROR_CHECK(err_code);
		break; // BLE_EVT_USER_MEM_REQUEST

