dkwill/nRF52_MD612_Quats_Accel_wBLE/ble_peripheral/ble_app_md612/main.c
	advdata.name_type = BLE_ADVDATA_FULL_NAME;
	advdata.include_appearance = true;
	advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

	memset(&options, 0, sizeof(options));
	options.ble_adv_whitelist_enabled = true;
	options.ble_adv_directed_enabled = true;
	options.ble_adv_directed_slow_enabled = false;
	options.ble_adv_directed_slow_interval = 0;
	options.ble_adv_directed_slow_timeout = 0;
	options.ble_adv_fast_enabled = true;
	options.ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
	options.ble_adv_fast_timeout = APP_ADV_FAST_TIMEOUT;
	options.ble_adv_slow_enabled = true;
	options.ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
	options.ble_adv_slow_timeout = APP_ADV_SLOW_TIMEOUT;

	err_code = ble_advertising_init(&advdata,
	NULL, &options, on_adv_evt, ble_advertising_error_handler);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void) {
	APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

static void ble_mde_update(ble_mde_t *p_mde, int16_t* x, int16_t* y, int16_t* z)
{
    // Send value if connected and notifying
    if (p_mde->conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        uint16_t      len = sizeof(int16_t);
        ble_gatts_hvx_params_t hvx_params;
        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_mde->x_char_handles.value_handle;
        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
        hvx_params.offset = 0;
        hvx_params.p_len  = &len;
        hvx_params.p_data = (uint8_t*) x;
        sd_ble_gatts_hvx(p_mde->conn_handle, &hvx_params);

        hvx_params.handle = p_mde->y_char_handles.value_handle;
		hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
		hvx_params.offset = 0;
		hvx_params.p_len  = &len;
		hvx_params.p_data = (uint8_t*) y;
		sd_ble_gatts_hvx(p_mde->conn_handle, &hvx_params);

		hvx_params.handle = p_mde->z_char_handles.value_handle;
		hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
		hvx_params.offset = 0;
		hvx_params.p_len  = &len;
		hvx_params.p_data = (uint8_t*) z;
		sd_ble_gatts_hvx(p_mde->conn_handle, &hvx_params);

    }
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
static void bsp_event_handler(bsp_event_t event) {
	uint32_t err_code;

	NRF_LOG_INFO("bsp_event_handler %d \r\n", event);

	switch (event) {
	case BSP_EVENT_SLEEP:
		NRF_LOG_INFO("sleep \r\n");
		sleep_mode_enter();
		break;

	case BSP_EVENT_DISCONNECT:
		NRF_LOG_INFO("disconnect \r\n" );
		err_code = sd_ble_gap_disconnect(m_mde.conn_handle,	BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		if (err_code != NRF_ERROR_INVALID_STATE) {
			APP_ERROR_CHECK(err_code);
		}
		break;

	case BSP_EVENT_WHITELIST_OFF:
		NRF_LOG_INFO("whitelist off \r\n");
		if (m_mde.conn_handle == BLE_CONN_HANDLE_INVALID) {
			err_code = ble_advertising_restart_without_whitelist();
			if (err_code != NRF_ERROR_INVALID_STATE) {
				APP_ERROR_CHECK(err_code);
			}
		}
		break;


	default:
		break;
	}
}

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds) {
	bsp_event_t startup_event;

	uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
			APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), bsp_event_handler);

	APP_ERROR_CHECK(err_code);

	err_code = bsp_btn_ble_init(NULL, &startup_event);
	APP_ERROR_CHECK(err_code);

	*p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void) {
	uint32_t err_code = sd_app_evt_wait();

	APP_ERROR_CHECK(err_code);
}
/**@brief Function for when the euler need to be sent BLE.
 */
static void motiondriver_callback(unsigned char type, long *data,int8_t accuracy, unsigned long timestamp) {


	switch (type) {
	case PACKET_DATA_EULER: {
		int16_t x = inv_q16_to_float(data[0]);
		int16_t y = inv_q16_to_float(data[1]);
		int16_t z = inv_q16_to_float(data[2]);

		//if (ble_conn_state_encrypted(m_mde.conn_handle) ) {
		if (ble_conn_state_status(m_mde.conn_handle) == BLE_CONN_STATUS_CONNECTED) {
			NRF_LOG_INFO("Euler: [" NRF_LOG_FLOAT_MARKER " " NRF_LOG_FLOAT_MARKER " " NRF_LOG_FLOAT_MARKER "]\r\n", NRF_LOG_FLOAT(x), NRF_LOG_FLOAT(y), NRF_LOG_FLOAT(z));
			NRF_LOG_INFO("E, 0x%hx, 0x%hx, 0x%hx, 0x%hx\n", accuracy, x, y, z);

			ble_mde_update (&m_mde, &x, &y, &z);

		}
		break;
	}
	default:
		break;

	}
}

void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info) {
	NRF_LOG_ERROR("Fatal: %d %d %d\r\n", id, pc, info)
	NRF_LOG_FINAL_FLUSH()
	;
	// On assert, the system can only recover with a reset.
#ifndef DEBUG
	NVIC_SystemReset();
#else
	app_error_save_and_stop(id, pc, info);
#endif // DEBUG
}
#ifdef xNRF_LOG_BACKEND_SERIAL_USES_UART
 void uart_error_handle(app_uart_evt_t * p_event)
 {
     if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
     {
         APP_ERROR_HANDLER(p_event->data.error_communication);
     }
     else if (p_event->evt_type == APP_UART_FIFO_ERROR)
     {
         APP_ERROR_HANDLER(p_event->data.error_code);
     }
 }

 static void uart_init(void)
 {
     uint32_t err_code;

     app_uart_comm_params_t const comm_params = {
         RX_PIN_NUMBER,
         TX_PIN_NUMBER,
         RTS_PIN_NUMBER,
         CTS_PIN_NUMBER,
         APP_UART_FLOW_CONTROL_ENABLED,
         false,
         UART_BAUDRATE_BAUDRATE_Baud115200
     };

     APP_UART_FIFO_INIT(&comm_params,
                          UART_RX_BUF_SIZE,
                          UART_TX_BUF_SIZE,
                          uart_error_handle,
                          APP_IRQ_PRIORITY_LOW,
                          err_code);

     APP_ERROR_CHECK(err_code);
 }
#endif
/**@brief Initialize the TWI interface from the NRF52 to the MPU9260.
 */
static void twi_init(void) {
	uint32_t err_code;

	nrf_drv_twi_config_t const twi_config = {
			.scl = ARDUINO_SCL_PIN,
			.sda = ARDUINO_SDA_PIN,
			.frequency = NRF_TWI_FREQ_400K,
			.interrupt_priority = APP_IRQ_PRIORITY_HIGH };

	APP_TWI_INIT(&m_app_twi, &twi_config, TWI_MAX_PENDING_TRANSACTIONS,
			err_code);
	APP_ERROR_CHECK(err_code);
}
/**@brief Function to initialize and test the md612 drivers.
 */
static void motiondriver_init(void) {
	NRF_LOG_INFO("Motion Driver init...\r\n");

	md612_configure(&platform_data);
	md612_selftest();

}
/**@brief Function for application main entry.
 */
int main(void) {
	bool erase_bonds;
	uint32_t err_code;

	// Initialize.
	err_code = NRF_LOG_INIT(timestamp_func);
	APP_ERROR_CHECK(err_code);

	timers_init();
	buttons_leds_init(&erase_bonds);
	twi_init();
	nrf_delay_ms(10);

	motiondriver_init();
	ble_stack_init();

	scheduler_init();

	peer_manager_init(erase_bonds);

	if (erase_bonds == true) {
		NRF_LOG_INFO("Bonds erased!\r\n");
	}

	gap_params_init();
	advertising_init();
	services_init();
	sensor_simulator_init();
	conn_params_init();

	// Start execution.
	timers_start();

	advertising_start();

	NRF_LOG_INFO("Enter main loop\r\n");
	// Enter main loop.
	for (;;) {
		app_sched_execute();

		md612_beforesleep();

		if (NRF_LOG_PROCESS() == false && md612_hasnewdata() == false) {
			power_manage();
			continue;
		}

		md612_aftersleep();

	}  // for loop

} // Main
/**
 * @}
 */

